"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Extraer en la carpeta actual";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Extraer en Escritorio";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Extraer en...";
